Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Вид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/Вид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Вид</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.Вид.ЮридическоеЛицо") Тогда 
		Элементы.ФизическоеЛицо.Видимость = Ложь;
		Элементы.ФизическоеЛицоИНН.Видимость = ложь;
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Ложь;
		Элементы.ЮридическоеЛицо.Видимость = Истина;
		Элементы.ЮридическоеЛицоИНН.Видимость = Истина;
        Элементы.КПП.Видимость = Истина; 
		Элементы.НаименованиеПолное.Заголовок = "Наименование полное";
		
		Объект.ФизическоеЛицо = Неопределено; 
		Объект.ДокументУдостоверяющийЛичность = Неопределено;  
		
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.Вид.ФизическоеЛицо") Тогда
		Элементы.ФизическоеЛицо.Видимость = Истина;
		Элементы.ФизическоеЛицоИНН.Видимость = Истина;
		Элементы.ДокументУдостоверяющийЛичность.Видимость = Истина;
		Элементы.ЮридическоеЛицо.Видимость = Ложь; 
		Элементы.ЮридическоеЛицоИНН.Видимость = Ложь;
        Элементы.КПП.Видимость = Ложь; 
		Элементы.НаименованиеПолное.Заголовок = "ФИО";
		
		Объект.ЮридическоеЛицо = Неопределено;
		Объект.КПП = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ОсновнойДоговор = ПолучитьОсновнойДоговорДоговоры(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнойДоговорДоговоры(СсылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Владелец = &Владелец
		|	И Договоры.ОсновнойДокумент = &ИСТИНА";
	
	Запрос.УстановитьПараметр("Владелец", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИСТИНА", ИСТИНА);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
   	Возврат Неопределено;
	
КонецФункции


//&НаСервере
//Процедура ОсновнойДоговорПриИзмененииНаСервере() 
//	//Удаление отметки со старого договора
//	ОсновнойДоговорСтарый = ПолучитьОсновнойДоговорДоговоры(Объект.Ссылка);
//	
//	ОсновнойДоговорСтарый = ОсновнойДоговорСтарый.ПолучитьОбъект();
//	ОсновнойДоговорСтарый.ОсновнойДокумент = Ложь;
//	ОсновнойДоговорСтарый.Записать();
//	
//	//Добавление метки к новому договору
//	УИДДоговора = Объект.ОсновнойДоговор.УникальныйИдентификатор();
//	
//	ОсновнойДоговорНовый = Справочники.Договоры.ПолучитьСсылку(УИДДоговора);
//	ОсновнойДоговорНовый = ОсновнойДоговорНовый.ПолучитьОбъект();
//	ОсновнойДоговорНовый.ОсновнойДокумент = Истина;
//	ОсновнойДоговорНовый.Записать();
//	
//	ЭтаФорма.Записать();
//КонецПроцедуры


//&НаКлиенте
//Процедура ОсновнойДоговорПриИзменении(Элемент)
//	ОсновнойДоговорПриИзмененииНаСервере();
//КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВСправочник(Команда)
	Запись = Истина;
	Закрывать = Ложь;
	ПоказатьВопросИзменениеДоговораПриЗакрытии(Запись, Закрывать);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Запись = Ложь;
	Закрывать = Истина;
	ПоказатьВопросИзменениеДоговораПриЗакрытии(Запись, Закрывать);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросИзменениеДоговораПриЗакрытии(ПараметрЗаписи, Закрывать) //Переписать	
	Если Объект.ОсновнойДоговор.Пустая() Тогда
		УдалитьОсновнойДокумент();
		 
		Если Закрывать Тогда
					 
			ЭтаФорма.Записать();
			ЭтаФорма.Закрыть();
					
		ИначеЕсли Не Закрывать Тогда
					
			ЭтаФорма.Записать();
					
		КонецЕсли; 
		
	Иначе 
		ОсновнойДоговор = ПолучитьОсновнойДокументКонтрагенты(Объект.ОсновнойДоговор);
			
			Если Не ОсновнойДоговор Тогда
				
				ОсновнойДоговорСтарый = ПолучитьОсновнойДоговорДоговоры(Объект.Ссылка);
				
				Если ОсновнойДоговорСтарый <> Неопределено Тогда
					
					Отказ = Истина;
					
					ПараметрыЗаписи = Новый Структура();
					
					ПараметрыЗаписи.Вставить("Запись", ПараметрЗаписи);
					ПараметрыЗаписи.Вставить("СтарыйДоговор", ОсновнойДоговорСтарый); 


					ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, ПараметрыЗаписи),
					"Договор """ + ОсновнойДоговорСтарый + """ уже является основным для контрагента. Перезаписать?", 
					РежимДиалогаВопрос.ДаНет);

				ИначеЕсли Закрывать Тогда
					
					ИзменитьОсновнойДокумент();
					ЭтаФорма.Записать();
					ЭтаФорма.Закрыть();
					
				ИначеЕсли Не Закрывать Тогда
					
					ИзменитьОсновнойДокумент();
					ЭтаФорма.Записать();
					
				КонецЕсли; 
				
			Иначе
						
				Если Закрывать Тогда 
					ЭтаФорма.Записать();
					ЭтаФорма.Закрыть();
				ИначеЕсли Не Закрывать Тогда 
					ЭтаФорма.Записать();
				КонецЕсли;
				
			КонецЕсли
      КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ПараметрыЗаписи) Экспорт; 		
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ИзменитьОсновнойДокумент();	
		
		Если ПараметрыЗаписи.Запись Тогда				
			ЭтаФорма.Записать();
		КонецЕсли;
			
		Если Не ПараметрыЗаписи.Запись Тогда 			
			ЭтаФорма.Записать();
			ЭтаФорма.Закрыть(); 				
		КонецЕсли;

	КонецЕсли;  
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнойДокументКонтрагенты(Договор)	

	ОсновнойДоговорНовый = Договор.ПолучитьОбъект();
	Возврат ОсновнойДоговорНовый.ОсновнойДокумент;

КонецФункции


&НаСервере
Процедура ИзменитьОсновнойДокумент()	 
	//Удаление метки со старого договора
	ОсновнойДоговорСтарый = ПолучитьОсновнойДоговорДоговоры(Объект.Ссылка);
	
	Если ОсновнойДоговорСтарый <> Неопределено Тогда

		ОсновнойДоговорСтарый = ОсновнойДоговорСтарый.ПолучитьОбъект();
		ОсновнойДоговорСтарый.ОсновнойДокумент = Ложь;
		ОсновнойДоговорСтарый.Записать();
	КонецЕсли;

	//Добавление метки к новому договору
	ОсновнойДоговорНовый = Объект.ОсновнойДоговор.ПолучитьОбъект();
	ОсновнойДоговорНовый.ОсновнойДокумент = Истина;
	ОсновнойДоговорНовый.Записать()
КонецПроцедуры 

Процедура УдалитьОсновнойДокумент() //Объединить с ИзменитьОсновнойДокумент!!!!!!!!!!!!! 
	ОсновнойДоговорСтарый = ПолучитьОсновнойДоговорДоговоры(Объект.Ссылка);
	
	Если ОсновнойДоговорСтарый <> Неопределено Тогда
	
		ОсновнойДоговорСтарый = ОсновнойДоговорСтарый.ПолучитьОбъект();
		ОсновнойДоговорСтарый.ОсновнойДокумент = Ложь;
		ОсновнойДоговорСтарый.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВосстановитьЗначенияРеквизитовФормы();
	ВидПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СохранитьЗначенияРеквизитовФормы();
КонецПроцедуры


#Область РаботаСРеквизитамиФормы 

&НаСервере
Процедура СохранитьЗначенияРеквизитовФормы()
	Если Не Объект.Ссылка.Пустая() Тогда
		Настройки = Новый Соответствие;
		
		Настройки.Вставить("ЮридическийАдрес", ЮридическийАдрес);
		Настройки.Вставить("ФактическийАдрес", ФактическийАдрес);
		Настройки.Вставить("ПочтовыйАдрес", ПочтовыйАдрес);
		Настройки.Вставить("ТелефонКонтрагента", ТелефонКонтрагента);
		Настройки.Вставить("ФаксКонтрагента", ФаксКонтрагента);
		Настройки.Вставить("ЭлектроннаяПочтаКонтрагента", ЭлектроннаяПочтаКонтрагента);
		Настройки.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация);
		
		СерверныеПроцедуры.СохранитьЗначенияРеквизитов(Объект.Ссылка, Настройки);
	КонецЕсли;
КонецПроцедуры 

Процедура ВосстановитьЗначенияРеквизитовФормы()
	ЗначенияРеквизитов = СерверныеПроцедуры.ВосстановитьЗначенияРеквизитов(Объект.Ссылка);
	
	Если ТипЗнч(ЗначенияРеквизитов) = Тип("Соответствие") Тогда
		ЮридическийАдрес = ЗначенияРеквизитов.Получить("ЮридическийАдрес");
		ФактическийАдрес = ЗначенияРеквизитов.Получить("ФактическийАдрес");
		ПочтовыйАдрес = ЗначенияРеквизитов.Получить("ПочтовыйАдрес");
		ТелефонКонтрагента = ЗначенияРеквизитов.Получить("ТелефонКонтрагента");
		ФаксКонтрагента = ЗначенияРеквизитов.Получить("ФаксКонтрагента");
		ЭлектроннаяПочтаКонтрагента = ЗначенияРеквизитов.Получить("ЭлектроннаяПочтаКонтрагента");
		ДополнительнаяИнформация = ЗначенияРеквизитов.Получить("ДополнительнаяИнформация");
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
